\documentclass[a4paper, ${fontsize}pt]{article}

\usepackage{url}
\usepackage{enumitem}
\usepackage{setspace}
\usepackage[hang]{footmisc}
\usepackage{fontspec}
\usepackage{polyglossia}
\usepackage{titlesec}
\usepackage{xcolor}

\usepackage[
  bookmarks=true,
  colorlinks=true,
  linkcolor=linkcolor,
  urlcolor=linkcolor,
  citecolor=linkcolor,
  pdftitle={Mirza Font Testing Document},
  ]{hyperref}

\definecolor{textcolor}  {rgb}{.25,.25,.25}
\definecolor{pagecolor}  {rgb}{1.0,.99,.97}
\definecolor{titlecolor} {rgb}{.67,.00,.05}
\definecolor{linkcolor}  {rgb}{.80,.00,.05}
\definecolor{codecolor}  {rgb}{.90,.90,.90}

\setmainlanguage {arabic}
\setotherlanguage{english}
\rightfootnoterule

\setmainfont               [Path=./Generated/,Ligatures=TeX]                     {$fontfile}
\setmonofont               [Scale=MatchLowercase]              {DejaVu Sans Mono}
\newfontfamily\arabicfont  [Path=./Generated/,Script=Arabic,Numbers=Proportional]{$fontfile}
\newfontfamily\arabicfonttt[Script=Arabic,Scale=MatchLowercase]{DejaVu Sans Mono}

\newcommand\addff[1]{\addfontfeature{RawFeature={#1}}} % add feature
\newcommand\addfl[1]{\addff{language=#1}}              % add language

\setlength{\parindent}{0pt}
\setlength{\parskip}{1em plus .2em minus .1em}
%setlength{\emergencystretch}{3em}  % prevent overfull lines
\setcounter{secnumdepth}{0}

\newfontfamily\titlefont[Path=./Generated/,Script=Arabic]{$fontfile}

\titleformat*{\section}{\Large\titlefont\color{titlecolor}}
\titleformat*{\subsection}{\large\titlefont\color{titlecolor}}
\titleformat*{\subsubsection}{\itshape\titlefont\color{titlecolor}}

\titlespacing{\section}{0pt}{*4}{*1}
\titlespacing{\subsection}{0pt}{*3}{0pt}
\titlespacing{\subsubsection}{0pt}{*2}{0pt}

\renewcommand\U[1]{\colorbox{codecolor}{\texttt{U+#1}}}

\title{Mirza Font Testing Document $fontfile $fontsize pt}

\begin{document}
\pagecolor{pagecolor}
\color{textcolor}

\begin{english}\maketitle\end{english}
\newpage

\begin{flushright}
\fontsize{${fontsize}pt}{${lineheight}pt}\selectfont

يَجِبُ عَلَى الإنْسَانِ أن يَكُونَ أمِيْنَاً وَصَادِقَاً مَعَ نَفْسِهِ وَمَعَ أَهْلِهِ

يَجِبُ : مِن وَجَبَ (مِثَال ) , فِعْلٌ مُضَارِعٌ مَرْفُوعٌ بِضَمَّةٍ .It is necessary
عَلَى الإِنْسَانِ : عَلى: حَرفُ جَرٍّ , الإِنْسَان:ِ َمَجْرُورٌ بِكَسْرَة  for man
أَنْ : حَرفُ نَصْب to
يَكُونَ : مِن كَانَ ( أَجْوَفٌ ) ويَدْخُلُ الجُمْلَةَ الإِسْمِيَّةَ وَيَنْصِبُ خَبَرَهَا to be.
أَمِيْناً : خَبَرُ يَكُونُ وَهُو مَنْصُوبٌ . وَاسْمُ كَانَ مُقَدَّرٌ ( يَكُونُ هُوَ أَمِيْنَا) honest, faithful
وَصَادِقَاً : و: حَرفُ عَطْفٍ , تَعْطِفُ مَا بَعْدَهَا لِمَا قَبْلَهَا , صَادِقَاً: مَعْطُوفَةٌ
            والمَعْطُوفُ يَتْبَعُ مَا قَبْلَهُ لذلِكَ فَهُوَ مَنْصُوبٌ  truthful
مَعَ نَفْسِهِ : مَعَ : حَرفُ جَرٍّ , نَفْسِ:مَجْرُورٌ بِكَسْرَةٍ , الهَاء: ضَمِيْرٌ مًتَّصِلٌ
            فِي مَحَلِ جَرِّ مُضَافِ إِلَيْهِ .with himself
وَمَعَ أَهْلِهِ : و: حَرفُ عَطْفٍ , مَعَ أَهْلِهِ : جَارٌّ وَمَجْرُورٌ وضَمِيْرٌ فِي مَحَلِّ
            مُضَافِ إِلَيْهِ with his family (people).

وَجِيْرَانِهِ وَأَنْ يَبْذُلَ كُلَّ جُهْدٍ فِي إِعْلاءِ شَأْنِ الوَطَنِ وَأَنْ يَعْمَلَ
وَجَيْرَانِهِ : و: حَرْفُ عَطْفٍ , جِِيْرَانِهِ : مَعَ جِيْرَانِهِ : جَارٌّ وَمَجْرُورٌ
                وضَمِيْرٌ فِي مَحَلِّ مُضَافِ إِلَيْهِ with his neighbours
                المُفْرَدُ : جَارٌ       الجَمْعُ : جِيْرَان
وَأَن يَبْذُلَ: و: حَرْفُ عَطْفٍ , أَن: النَّاصِبَة      يَبْذُلَ: مِن بَذَلَ : مُضَارِعٌ
            مَنْصُوبٌ بِأَنْ وَعَلامَةُ النَّصْبِ الفَتْحَةُ .and to exert
كُلَّ :          مَفْعُولٌ بِهِ للفِعْلِ بَذَلَ مَنْصُوبٌ بِفَتْحَةٍ .every / all
جُهْدٍ : مُضَافُ إِلَيْهِ مَجْرُورٌ بِكَسْرِةٍ .effort
فِي إِعْلاءِ : فِي :جَارٌّ وَمَجْرُورٌ بِكَسْرَةٍ . إِعْلاءِ : مِن عَلا- يَعْلُوexaltation
شَأْنِ : مُضَافٌ إِلَيْهِ مَجْرُورٌ بِكِسْرَةٍ .affair/ concern
الوَطنِ : مُضَافٌ إِلَيْهِ مَجْرُورٌ . وَطَن: جَمْعُهَا أَوْطَان.motherland
وَأَن يَعْمَلَ : و: حَرْفُ عَطْفٍ , أَن: النَّاصِبَة , يَعْمَلَ : مِن عَمِلَ : مُضَارِعٌ
            مَنْصُوبٌ بِأَنْ وَعَلامَةُ النَّصْبِ الفَتْحَةُ.and to work

عَلَى مَا يَجْلِبُ السَّعَادَةَ لِلنَّاسِ . ولَن يَتِمَّ لَهُ ذلِك إِلا بِأَنْ يُقَدِّمَ
عَلَى : حَرفُ جَرٍّ on/ towards
مَا : إسْمٌ مَوْصُولٌ مَبْنِي فِي مَحَلِ جَرٍّ .what (that)
يَجْلِبُ : مِن جَلَبَ : مُضَارِعٌ مَرْفُوعٌ بِالضَمَّةِ . والفَاعِلُ مُسْتَتِرٌ بِالفِعْلِ (هُوَ)brings
السَّعَادَةَ : مَفْعُولٌ بِهِ مَنْصُوبٌ بِفَتْحَةٍ .happiness
لِلْنَّاسِ : اللام : حَرفُ جَرٍّ ,  ناسِ : مَجْرُورٌ بِكَسْرَةٍ .to people
وَلَنْ : و: حَرْفُ عَطْفٍ ,  لَنْ: حَرْفُ نَصْبٍ This will not/ it will not be
يَتِمَّ : من تَمَّ ( مُضَعَّفٌ) مَنْصُوبٌ بِفَتْحَةٍ .accomplish
لَهُ : اللام : حَرفُ جَرٍّ  و الهاء: ضَمِيْرٌ مُتَّصِلٌ مَبْنِيٌّ فِي مَحَلِّ جَرٍّ .to him
ذلِكَ: إسْمُ إِشَارَةٍ مَبْنِيٌّ .that
إِلا : أَدَاةُ إِسْتِثْنَاء مَبْنِيَّةٌ .except
بِأَنْ : الباء: حَرفُ جَرٍّ ,  أَنْ: حَرْفُ نَصْبٍ .with
يُقَدِّمَ : مِن قَدَّمَ عَلَى وَزْنِ فَعَّلَ , مَضَارِعٌ مَنْصُوبٌ بِفِتْحَةٍ والفَاعِلُ مُقَدَّرٌ (هُوَ)
‏Prefer / put first


المَنْفَعَةَ العَامَّةَ عَلَى المَنْفَعَةِ الخَاصَّةِ وَهذَا مِثَالٌ لِلتَّضْحِيَةِ .
 المَنْفَعَةَ : مَفْعُولٌ بَهِ مَنْصُوبٌ بِفَتْحَةِbenefit / interest
            (نَفَعَ , مَنْفَعَةٌ وَجَمْعثهَا مَنَافِعٌ) .
العَامَّةَ : نَعْتٌ مَنْصُوبٌ بِفَتْحَةٍ ( النَّعْتُ يَتْبَعُ المَنْعُوتُ )general
عَلَى : حَرْفُ جَرٍّ مَبْنِي .on / over
المَنْفَعَةِ : مَجْرُور بِكَسْرَةٍ
الخَاصَّةِ : نَعْتٌ مَجْرُورٌ بِكَسْرَةٍ .personal
وَهَذَا : و: حَرْفُ عَطْفٍ , هَذَا : إِسْمُ إِشَارَةٍ فِي مَحَلِ مُبْتَدَأٍ and this
مِثَالٌ : خَبَر , وَعلامَةُ الرَّفْعِ الضَّمَةِ .a symbol/paradigm
للتَضْحِيَةِ : اللامُ : حَرْفُ جَرٍّ , التَّضْحِيَةِ : مَجْرُورٌ بِكَسْرَةٍ .for sacrifice
(ضَحَّى - يُضَحِّي – تَضْحِيَةٌ - نَاقِص )
عِنْدَمَا قَدِمْتُ عَلَى (صَاحِبِي) فِي الصَّبَاحِ وَجَدْتُهُ يَشْتَغِلُ فِي
(بُسْتَانِه)ِ فَقَرَبْتُ مِنْهُ مَسَلِّمَاً عَلَيْهِ فَرَدَّ (التَّحِيَّةَ) وَظَلَّ مُنْهَمِكَاً فِي
(عَمَلِه)ِ. فَقُلْتُ لَهُ : إِنَّكَ (جَاهِل)ٌ (لأدَبِ) (الزِّيَارَةِ) , فَضًحِكَ
قَائِلاً : لا ! إِنَّمَا عَرَفْتُ أَضْرَارَ الزِّيَارَةِ فِي وَقْتِ العَمَلِ ,
فَبَقَيْتُ مُتَابِعَاً (شُغْلِي) لَعَلَكِ تَتَعَلَّمَ الحِرْصَ عَلَى الوَقْتِ . فَالحَيَاةُ
عَمَلٌ (والوَقْت)ُ (حَقْلٌ) والإِنْسَانُ قَيِّمٌ عَلَيْهِ وَلَعَلَّ المرءَ الَّذي
تَرَكَ عَمَلَ يَوْمِهِ إِلَى غَدِهِ فَرِغَ يَوْمُهُ , فأتْرُكْنِي الآنَ وَجِئْنِي فِي
المَسَاءِ , ثُمَّ رَجَعَ إِلَى عَمَلِهِ كَأَنَّهُ غَيْرُ شَاعِرٍ بِي , وَرَجَعْتُ
مَتَّعِظَاً لِسَمَاعِ هَذِهِ (النَصِيْحَة) .

الفعل في النص      الماضي    المُضارع      الأمر     (مخاطب)
      قَدِمْتُ          قَدِمْتُ     أَقْدَمُ             أَقْدِمْ
     وَجدته          وَجَدْتُهُ    أَجِدْهُ             جِدْ
      يشتغل            إشْتَغَلَ      يَشْتَغِلُ             إِشْتَغِلْ
      فقربت            قَرَبْتُ       أَقْرُبُ             إِقْرَبْ
      فَرَدَّ               رَدَّ          يَرُدُّ               رُدَّ
      وظلَّ              ظَلَّ         يَظَلُّ              ظَلَّ
      فقلتُ              قُلْتُ         أَقُولُ              قُلْ
      فضحكَ           ضَحِكَ       يَضْحَكُ           إِضْحَكْ
      عَرَفْتَ         عرَفْتُ         أَعْرِفُ            إِعْرَفْ
      فبقيتُ             بَقَيْتُ        أَبْقَى              إِبْقَ
تتعلّم              تَعَلَّمْتَ      تَتَعَلَّمُ              تَعَلَّمْ
تركَ              تَرَكَ        يَتْرُكُ             أُتْرُكْ
وجِئْنِي            جَاءَنِي      يَجِيئُنِي            جِئْنِي
رَجَعَ              رَجَعَ        يرْجَعُ             إِرْجَعْ


مُسَلِّماُ : حال منصوب ( كيف قربت منه ؟ مُسَلِّمَاً ) .
      ( سَلَّمَ , يُسَلِّمُ , مُسَلِّمٌ , مُسَلَّمٌ , تَسْلِيْمٌ) .
التَّحِيَّة : مفعول به منصوب ( حَيَّا , يُحَيّي , مُحَيٍّ , مُحَيَّاً , تَحِيَّة )
مُنهمكا : خبر ظلَّ منصوب ( إِنْهَمَكَ , يَنْهَمِكُ , مُنْهَمِكٌ , مُنْهَمَكٌ, إِنْهِمَاكٌ) .
أَضْرَارَ : مفعول به منصوب .
مُتَابِعَاٌ : حال منصوب بفتحة ( كَيْفَ بَقيتُ ؟ - مُتَابِعَاً )
      ( تَابَعَ , يُتَابِعُ , مُتَابِعٌ , مُتَابَعٌ , مُتَابَعَةٌ ) .
الحرصَ : مفعول به منصوب
المرءَ : إسم لعل منصوب بفتحة .
عملَ : مفعول به منصوب .
الآنَ : ظرف زمان منصوب بفتحة .
مُتَّعِظَاً : حال منصوب ( كيف رَجَعْتُ ؟ - مُتَّعِظَاً )
      ( إِتَّعَظَ , يَتَّعِظُ , مُتَّعِظٌ , مُتَّعَظٌ , إِتِّعَاظٌ )
      ملاحظة : الفعل هو وَعَظَ ( مثال ) الواو تحولت إلى تاء وأُدْغِمت مع
                  تَاءِ وزن الفعل . إِوْتَعَظَ >>> إِتَّعَظَ .

جمع الأسماء :
صاحِب : أَصْحَابٌ
بُسْتَان : بَسَاتِيْنُ
تَحِيَّةٌ : تَحِيَّاتٌ .
عَمَل : أَعْمَالٌ
جَاهِلٌ : جَاهِلُونَ , جَهَلَةٌ .
أَدَبٌ : آدَابٌ
زِيَارَةٌ : زِيَارَاتٌ
شُغْلٌ : أَشْغَالٌ
وَقْتٌ : أَوْقَاتٌ
حَقْلٌ : حُقُولٌ .
نَصِيْحَةٌ : نَصَائِحُ .

سبب الرَّفع :
جَاهِلٌ : خبر إِنَّ مرفوع بضمَّة .
الحياةُ عَمَلٌ : مبتدأٌ وخَبَرٌ و مرفوعان بضمة .
والوقْتُ قَيِّمٌ : معطوف , مبتدأٌ وخَبَرٌ و مرفوعان بضمة .
والإنسانُ قَيِّمٌ : معطوف , مبتدأٌ وخَبَرٌ و مرفوعان بضمة .
يومُهُ : فَاعِلٌ مرفوع بضمَّةٍ .
غَيْرُ : خبر كَأَنَّ مرفوع .
إِبْنَتِي ! لَيْسَ فِي هَذِهِ الرِّسَالَةِ مَالُ تَنْتَفِعِيْنَ بَهِ , وَلا ذَهَبُ
الرِّسَالَةِ : بَدَل مِن هذهِ , هذه مجرورة والرسالة مجرورة
مالٌ : مبتدَأٌ مرفوع , فِي هذه الرِّسَالة : جار ومجرور (خبر)
      جمع مال = أموَالٌ       جمعُ رسَالة : رَسَائِل
ولا ذهبُ : معطوفة بالواو على مالُ فهي مرفوعة أيضاَ .


تَتحَلِّيْنَ بِهِ , وَلَكِن فِيْهَا قَلْبُ أَبٍ يُقَدِّمُهُ لإبْنَتِهِ .
تَتَحَلَّيْنَ : مُضارع منصوب بثبوت النون مع ياء المخاطبة .
            وهي من الفعل تَحَلَّى (تَفَعَلَ النَّاقص)
قلبُ : مبتدَأ مرفوع , والخبر: فيها قلب
يُقَدِّمُهُ : مثضارع مرفوع بضمَّة : والفاعِل مستتر (هُو) والهاء
      ضمير متَّصل في محل نصب مفعول به . والفعل يُقَدِّم
      مِن قَدَّم ( فَعَّلَ)


كَم يَسُرُّنِي أَنْ أَرَاكِ تَنْمِيْنَ كَسَنَابِلِ الحَقْلِ وَتَشُعِّيْنَ كَشُعْلَةٍ
يَسُرُّ : فِعل مضارع مرفوع بضمَّة والياء ضمير متصل وهو الفاعل.
      والفعل من سَرَّ ( مضعّف).
أراكَ : أرَى: فعل مضارع منصوب بِأن وعلامة النصب فتحة مقدرة على
الألف . والفاعل ضمير مستتر (أنا) والكاف ضمير متصل (مفعول به) والفعل هو رَأَى .
تَنْمِيْنَ : فعل مضارع مرفوع بثبوت النون مع ياء المخاطبة ( وهي الفاعل)
      وهي من الفعل نَمَا - ينمو
سنابل : مجرورة بالكاف وعلامة الجر الكسرة . مفردها = سُنْبُلَة
الحقل : مضاف إليه مجرور بالكسرة . جمعها = حُقُولٌ
وَتَشُعِّيْنَ : فعل مضارع مرفوع بثبوت النون مع ياء المخاطبة ( وهي الفاعل) , والفعل شَعَّ ( مضعَّف).
كشعلةٍ : مجرورة بالكاف وعلامة الجر الكسرة .

مِن النُّورِ , يَتَدَفَّقُ وَجْهُكِ بِالحَيَاءِ وَيَتَأَلَّقُ بِالأَمَلِ . إِنَّكِ تَفِدِيْنَ
يَتَدَفَّقُ : فعل مضارع مرفوع بضمَّة , من الفعل تَدَفَّقَ (تَفَعَّلَ)
وجهُكِ : وجهُ : فاعل مرفوع بضمَّة وهي مضاف , والكاف مضاف إليه .
            وجهٌ = جمعها وُجُوهٌ
يَتَأَلَّقُ : فعل مضارع مرفوع بضمَّة , من الفعل تَأَلَّقَ (تَفَعَّلَ) .
بِالأمَلِ : جار ومجرور .  جَمعُها : آمَال
تفدِينَ : فعل مضارع مرفوع بثبوت النون مع ياء المخاطبة ( وهي الفاعل) , والفِعل (وَفَدَ – يَفِدُ ) مثال الواو.

اليَومَ إِلَى المَدْرَسَةِ لِتَكْرَعِي مِن مَنَاهِلِ العِلْمِ والمَعْرِفَةِ أَقْصَى
اليومَ : ظرف زمان منصوب بفتحة . جمعها= أيَّامٌ
المدرسَةِ : مجرور بِإِلَى . جمعها = مَدَارِس
مناهِلِ : مجرور بمِن وهِي مضاف . مفردها : مَنْهَلٌ
العِلْمِ : مُضاف إليه مجرور بكسرة .
والمعرفة : معطوف على العلم فهي مجرورة أيضاً .

مَا يُمْكِنُ أَنْ تَسْتَوْعِبِيْهِ لأَنِّي أُرِيْدُ لَكِ ثَقَافَةً شَامِلَةً وَاعِيَةً لا
يُمْكِن : فِعل مضارع مرفوع بضمة ( أَمْكَنَ – يُمْكِنُ ) أَفْعَلَ – يُفْعِلُ .
تستوعبيه : فعل مضارع منصوب بِأَن وعلامة النصب حذف النون مع ياء
      المخاطبة ( أحد الأفعال الخمسة) والفاعل : ياء المخاطبة . والهاء:
      ضمير متصل في محل نصب مفعول به للفعل . والفعل من
      إستَوعَبَ – يَسْتَوعِبُ ( إسْتَفْعَلَ – يَسْتَفْعِلُ) .
أُرِيْدُ : فعل مضارع مرفوع بضمَّة ظَاهرة والفاعل مستتر (أنا)
ثَقَافَةً : مفعول به منصوب بفتحة ظاهرة , جمعها: ثَقَافَات

أَنْ تَحْمِلِي إِحْدَى الشَّهَادَاتِ العَالِيَةِ فَحَسْبُ , وَأَتَمَنَّى لَكِ ثَقَافَةً
تَحْمِلِي : فعل مضارع منصوب بِأَن وعلامة النصب حذف النون مع ياء
      المخاطبة ( أحد الأفعال الخمسة) والفاعل : ياء المخاطبة. (حَمَلَ)
الشَّهَادَات : بدل مِن إحدى , مفعول به منصوب بالكسرة (جمع مُؤَنَّث سالم)
           مفردها – شهادة.
أتمَنَّى : فعل مضارع مرفوع بضمة مقدّضرة على الألف والفاعل مستتر
      (أنا) والفعل ( تَمَنَّى يَتَمَنَّى ) تَفَعَّل ناقِص .
ثَقَافَةً : مفعول به منصوب بفتحة .

فَنِّيَّةً تُسَاعِدُكِ عَلَى فَهْمِ المُوسِيْقَى التي تَفَجَّرَتْ مِن أَعْمَاقِ
تُسَاعِدُكَ : تُسَاعِدُ : مضارع مرفوع بضمة والفاعل ضمير مستتر تقديره (هِيَ) والكاف: ضمير متصل مبني في محل نصب مفعول به . والفعل( سَاعَدَ – يُسَاعِدُ ) فَاعَلَ يُفَاعِلُ .
تَفَجَّرَتْ : فعل ماضِي مبني على الفتح  والفاعِل ضمير مستتر (هِي)
            والتَّاء للتَّأْنِيْث . ( تَفَجَّرَ – يَتَفَجَّرُ ) تَفَعَّلَ .
أَعْمَاقِ : اسم مجرور بمِن وعلامة الجر كسرة ظاهرة
          مفردها عُمْقٌ .

القُلُوبِ وَانْحَدَرَتْ عَلَى الأَنَامِلِ المُرْتَعِشَةِ , وَأَتَمَنَّى أَن تَتَذوَّقِي
القُلُوبِ : إسم مجرور بكسرة وهو مضاف إليه . مفردها – قلبٌ .
إنحدرت: فعل ماضِي مبني على الفتح  والفاعِل ضمير مستتر (هِي)
            والتَّاء للتَّأْنِيْث .(إِنْحَدَرَ – يَنْحَدِرُ) إِنْفَعَلَ .
الأنامل: مجرور بِعلى وعلامة الجر الكسرة , مفردها- أُنْمُلَةٌ
تَتَذوَّقِي : فعل مضارع منصوب بِأَن وعلامة النصب حذف النون مع ياء
      المخاطبة ( أحد الأفعال الخمسة) والفاعل : ياء المخاطبة .
      من الفعل ( تَذَوَّقَ – يَتَذَوَّقُ ) - تَفَعَّلَ

فَنَ التَّصْوِيْرِ لأَنَّ ذَلِكَ يَبُثَّ فِي رُوحِكِ مَحَبَّةَ تَرْتِيْبِ الأشْيَاءِ
فَنَّ : مفعول به منصوب بفتحة . جمعها فنون .
التَّصْوِيْر : مضاف إليه مجرور بكسرة ( مصدر للفِعل صَوَّرَ )
      صَوَّرَ  يُصَوِّرُ  مُصّوِّرٌ  مُصّوَّرٌ  تَصْوِيْرٌ
روحك : اسم مجرور بِفِي وعلامة الجر الكسرة وهي مضاف والكاف
      ضمير متصل في محل جر مضاف إليه . جمعها أرواح .
ترتيب : مضاف إليه مجرور والمضاف هو (محبة) , وهي أيضا مضاف.
      ترتيب : مصدر للفعل (رَتَّبَ) رَتَّبَ يُرَتِّبُ مُرَتِّبٌ مُرَتَّبٌ تَرْتِيْبٌ
الأشياء : مضاف إليه مجرور بكسرة . مفردها شَيءٌ

وَتَنْسِيْقِهَا بِذَوْقٍ .
تنسيقِها : معطوفة بواو العطف فهي مجرورة أيضاً . تنسيق: مصدر للفعل

          نَسَّق َ يُنَسِّقُ  مُنَسِّقٌ  مُنَسَّقٌ  تَنْسِيْقٌ
يَجِبُ عَلَى الإنْسَانِ أن يَكُونَ أمِيْنَاً وَصَادِقَاً مَعَ نَفْسِهِ وَمَعَ أَهْلِهِ وَجِيْرَانِهِ وَأَنْ يَبْذُلَ كُلَّ جُهْدٍ فِي إِعْلاءِ شَأْنِ الوَطَنِ وَأَنْ يَعْمَلَ عَلَى مَا يَجْلِبُ السَّعَادَةَ لِلنَّاسِ . ولَن يَتِمَّ لَهُ ذلِك إِلا بِأَنْ يُقَدِّمَ المَنْفَعَةَ العَامَّةَ عَلَى المَنْفَعَةِ الخَاصَّةِ وَهذَا مِثَالٌ لِلتَّضْحِيَةِ .


‏1) Show the Auxiliary Signs for Every Word in this text and give the reason.
يَجِبُ : مِن وَجَبَ (مِثَال ) , فِعْلٌ مُضَارِعٌ مَرْفُوعٌ بِضَمَّةٍ .It is necessary
عَلَى الإِنْسَانِ : عَلى: حَرفُ جَرٍّ , الإِنْسَان:ِ َمَجْرُورٌ بِكَسْرَة  for man
أَنْ : حَرفُ نَصْب to
يَكُونَ : مِن كَانَ ( أَجْوَفٌ ) ويَدْخُلُ الجُمْلَةَ الإِسْمِيَّةَ وَيَنْصِبُ خَبَرَهَا to be.
أَمِيْناً : خَبَرُ يَكُونُ وَهُو مَنْصُوبٌ . وَاسْمُ كَانَ مُقَدَّرٌ ( يَكُونُ هُوَ أَمِيْنَا) honest, faithful
وَصَادِقَاً : و: حَرفُ عَطْفٍ , تَعْطِفُ مَا بَعْدَهَا لِمَا قَبْلَهَا , صَادِقَاً: مَعْطُوفَةٌ
            والمَعْطُوفُ يَتْبَعُ مَا قَبْلَهُ لذلِكَ فَهُوَ مَنْصُوبٌ  truthful
مَعَ نَفْسِهِ : مَعَ : حَرفُ جَرٍّ , نَفْسِ:مَجْرُورٌ بِكَسْرَةٍ , الهَاء: ضَمِيْرٌ مًتَّصِلٌ
            فِي مَحَلِ جَرِّ مُضَافِ إِلَيْهِ .with himself
وَمَعَ أَهْلِهِ : و: حَرفُ عَطْفٍ , مَعَ أَهْلِهِ : جَارٌّ وَمَجْرُورٌ وضَمِيْرٌ فِي مَحَلِّ
            مُضَافِ إِلَيْهِ with his family (people).
وَجَيْرَانِهِ : و: حَرْفُ عَطْفٍ , جِِيْرَانِهِ : مَعَ جِيْرَانِهِ : جَارٌّ وَمَجْرُورٌ
                وضَمِيْرٌ فِي مَحَلِّ مُضَافِ إِلَيْهِ with his neighbours
                المُفْرَدُ : جَارٌ       الجَمْعُ : جِيْرَان
وَأَن يَبْذُلَ: و: حَرْفُ عَطْفٍ , أَن: النَّاصِبَة      يَبْذُلَ: مِن بَذَلَ : مُضَارِعٌ
            مَنْصُوبٌ بِأَنْ وَعَلامَةُ النَّصْبِ الفَتْحَةُ .and to exert
كُلَّ :          مَفْعُولٌ بِهِ للفِعْلِ بَذَلَ مَنْصُوبٌ بِفَتْحَةٍ .every / all
جُهْدٍ : مُضَافُ إِلَيْهِ مَجْرُورٌ بِكَسْرِةٍ .effort
فِي إِعْلاءِ : فِي :جَارٌّ وَمَجْرُورٌ بِكَسْرَةٍ . إِعْلاءِ : مِن عَلا- يَعْلُوexaltation
شَأْنِ : مُضَافٌ إِلَيْهِ مَجْرُورٌ بِكِسْرَةٍ .affair/ concern
الوَطنِ : مُضَافٌ إِلَيْهِ مَجْرُورٌ . وَطَن: جَمْعُهَا أَوْطَان.motherland
وَأَن يَعْمَلَ : و: حَرْفُ عَطْفٍ , أَن: النَّاصِبَة , يَعْمَلَ : مِن عَمِلَ : مُضَارِعٌ
            مَنْصُوبٌ بِأَنْ وَعَلامَةُ النَّصْبِ الفَتْحَةُ.and to work
عَلَى : حَرفُ جَرٍّ on/ towards
مَا : إسْمٌ مَوْصُولٌ مَبْنِي فِي مَحَلِ جَرٍّ .what (that)
يَجْلِبُ : مِن جَلَبَ : مُضَارِعٌ مَرْفُوعٌ بِالضَمَّةِ . والفَاعِلُ مُسْتَتِرٌ بِالفِعْلِ (هُوَ)brings
السَّعَادَةَ : مَفْعُولٌ بِهِ مَنْصُوبٌ بِفَتْحَةٍ .happiness
لِلْنَّاسِ : اللام : حَرفُ جَرٍّ ,  ناسِ : مَجْرُورٌ بِكَسْرَةٍ .to people
وَلَنْ : و: حَرْفُ عَطْفٍ ,  لَنْ: حَرْفُ نَصْبٍ This will not/ it will not be
يَتِمَّ : من تَمَّ ( مُضَعَّفٌ) مَنْصُوبٌ بِفَتْحَةٍ .accomplish
لَهُ : اللام : حَرفُ جَرٍّ  و الهاء: ضَمِيْرٌ مُتَّصِلٌ مَبْنِيٌّ فِي مَحَلِّ جَرٍّ .to him
ذلِكَ: إسْمُ إِشَارَةٍ مَبْنِيٌّ .that
إِلا : أَدَاةُ إِسْتِثْنَاء مَبْنِيَّةٌ .except
بِأَنْ : الباء: حَرفُ جَرٍّ ,  أَنْ: حَرْفُ نَصْبٍ .with
يُقَدِّمَ : مِن قَدَّمَ عَلَى وَزْنِ فَعَّلَ , مَضَارِعٌ مَنْصُوبٌ بِفِتْحَةٍ والفَاعِلُ مُقَدَّرٌ (هُوَ)
‏Prefer / put first
المَنْفَعَةَ : مَفْعُولٌ بَهِ مَنْصُوبٌ بِفَتْحَةِbenefit / interest
            (نَفَعَ , مَنْفَعَةٌ وَجَمْعثهَا مَنَافِعٌ) .
العَامَّةَ : نَعْتٌ مَنْصُوبٌ بِفَتْحَةٍ ( النَّعْتُ يَتْبَعُ المَنْعُوتُ )general
عَلَى : حَرْفُ جَرٍّ مَبْنِي .on / over
المَنْفَعَةِ : مَجْرُور بِكَسْرَةٍ
الخَاصَّةِ : نَعْتٌ مَجْرُورٌ بِكَسْرَةٍ .personal
وَهَذَا : و: حَرْفُ عَطْفٍ , هَذَا : إِسْمُ إِشَارَةٍ فِي مَحَلِ مُبْتَدَأٍ and this
مِثَالٌ : خَبَر , وَعلامَةُ الرَّفْعِ الضَّمَةِ .a symbol/paradigm
للتَضْحِيَةِ : اللامُ : حَرْفُ جَرٍّ , التَّضْحِيَةِ : مَجْرُورٌ بِكَسْرَةٍ .for sacrifice
(ضَحَّى - يُضَحِّي – تَضْحِيَةٌ - نَاقِص )
عِنْدَمَا قَدِمْتُ عَلَى (صَاحِبِي) فِي الصَّبَاحِ وَجَدْتُهُ يَشْتَغِلُ فِي
(بُسْتَانِه)ِ فَقَرَبْتُ مِنْهُ مَسَلِّمَاً عَلَيْهِ فَرَدَّ (التَّحِيَّةَ) وَظَلَّ مُنْهَمِكَاً فِي
(عَمَلِه)ِ. فَقُلْتُ لَهُ : إِنَّكَ (جَاهِل)ٌ (لأدَبِ) (الزِّيَارَةِ) , فَضًحِكَ
قَائِلاً : لا ! إِنَّمَا عَرَفْتُ أَضْرَارَ الزِّيَارَةِ فِي وَقْتِ العَمَلِ ,
فَبَقَيْتُ مُتَابِعَاً (شُغْلِي) لَعَلَكِ تَتَعَلَّمَ الحِرْصَ عَلَى الوَقْتِ . فَالحَيَاةُ
عَمَلٌ (والوَقْت)ُ (حَقْلٌ) والإِنْسَانُ قَيِّمٌ عَلَيْهِ وَلَعَلَّ المرءَ الَّذي
تَرَكَ عَمَلَ يَوْمِهِ إِلَى غَدِهِ فَرِغَ يَوْمُهُ , فأتْرُكْنِي الآنَ وَجِئْنِي فِي
المَسَاءِ , ثُمَّ رَجَعَ إِلَى عَمَلِهِ كَأَنَّهُ غَيْرُ شَاعِرٍ بِي , وَرَجَعْتُ
مَتَّعِظَاً لِسَمَاعِ هَذِهِ (النَصِيْحَة) .
                                عَن يُوسِف الحَداد


1) حَوِّل الأفْعَال المَاضِيَة التِي وَرَدَت إِلَى المًضَارِع وَأَشْكِلْهَا
2)          بَيِّنْ سَبَبَ النَصْبِ فِي الكَلِمَات الزَّرْقَاءِ .
3)     أُذْكُر إسمَ المَفْعُولِ والمَصْدَرِ مَع الأوْزَان ل :
مُسَلِّمٌ , مُنْهَمِكٌ , مُتَابِعٌ , مُتَّعِظٌ , شَاعِرٌ .
4)          أَعْطِ جَمْعَ الكَلِمَاتِ (بَيْنَ القَوْسَيْن) .
5)          بَيِّنْ سَبَبَ رَفْعِ الكَلِمَاتِ الحَمْرَاء .
6)          تَرْجِمْ إلَى الإنْجْلِيْزِيَّةِ القِطْعَةَ كَامِلَةً .
إِبْنَتِي ! لَيْسَ فِي هَذِهِ الرِّسَالَةِ مَالُ تَنْتَفِعِيْنَ بَهِ , وَلا ذَهَبُ
تَتحَلِّيْنَ بِهِ , وَلَكِن فِيْهَا قَلْبُ أَبٍ يُقَدِّمُهُ لإبْنَتِهِ .
كَم يَسُرُّنِي أَنْ أَرَاكِ تَنْمِيْنَ كَسَنَابِلِ الحَقْلِ وَتَشُعِّيْنَ كَشُعْلَةٍ
مِن النُّورِ , يَتَدَفَّقُ وَجْهُكِ بِالحَيَاءِ وَيَتَأَلَّقُ بِالأَمَلِ . إِنَّكِ تَفِدِيْنَ
اليَومَ إِلَى المَدْرَسَةِ لِتَكْرَعِي مِن مَنَاهِلِ العِلْمِ والمَعْرِفَةِ أَقْصَى
مَا يُمْكِنُ أَنْ تَسْتَوْعِبِيْهِ لأَنِّي أُرِيْدُ لَكِ ثَقَافَةً شَامِلَةً وَاعِيَةً لا
أَنْ تَحْمِلِي إِحْدَى الشَّهَادَاتِ العَالِيَةِ فَحَسْبُ , وَأَتَمَنَّى لَكِ ثَقَافَةً
فَنِّيَّةً تُسَاعِدُكِ عَلَى فَهْمِ المُوسِيْقَى التي تَفَجَّرَتْ مِن أَعْمَاقِ
القُلُوبِ وَانْحَدَرَتْ عَلَى الأَنَامِلِ المُرْتَعِشَةِ , وَأَتَمَنَّى أَن تَتَذوَّقِي
فَنَ التَّصْوِيْرِ لأَنَّ ذَلِكَ يَبُثَّ فِي رُوحِكِ مَحَبَّةَ تَرْتِيْبِ الأشْيَاءِ
وَتَنْسِيْقِهَا بِذَوْقٍ .
                                عن خليل الهنداوي


1)       حَوِّل القِطْعَةَ التَّالِيَةَ بِاسْتِعْمَالِكَ بَدَلاً مِن "إِبْنَتِي"
"بَناَتي"  و "إِبْنِي"  وَ " أَبْنَائِي"
2) ضَع القِطْعَةَ بِاسْتِعْمَالِكَ : "إِبْنَتُنَا" "إِبْنُنَا" "أَبْنَاؤُنَا" "بَنَاتُنَا" .
3)       مَا هُوَ مَحَلُّ الكَلِمَاتِ المُلَوَّنَة بِالأَزْرَق مِن الإِعْرَاب .
4)  إجْعَلْ المُفْرَدَ جَمْعَاً , والجَمْعَ مُفْرَدَاً فِي الأسمَاء الملوَّنَة بِالأحمر .
5)       مَا هُو وَزْنُ الأَفْعاَلِ المَذْكُورَةِ باللون الأخضر وَمَا إسْمُ فَاعِلِهَا وإسمُ مَفْعُولِهَا وَمَصْدَرُهَا .
6)  بَيِّنْ صِيْغَةَ الكَلِمَات المَذكُورَة , واذكُر وَزْنَ الفِعْلِ الذِي اشْتُقَّتْ مِنْها , ثُمَّ جِد إسْمَ الفَاعِلِ واسْمَ المَفْعُولِ والمَصْدَر .
7) ترجِمْ إلى الإنجليزيَّة .
\end{flushright}
\end{document}
